#    -*- mode: org -*-

#+TITLE: Lección 7. Modelos ARIMA y SARIMA. Identificación y diagnosis
#+author: Marcos Bujosa
#+LANGUAGE: es
# +OPTIONS: toc:nil

# https://machinelearningmastery.com/arima-for-time-series-forecasting-with-python/
# https://www.machinelearningplus.com/time-series/arima-model-time-series-forecasting-python/
# https://medium.com/datainc/time-series-analysis-and-forecasting-with-arima-in-python-aa22694b3aaa

# https://www.tigerdata.com/blog/how-to-work-with-time-series-in-python
# https://pyspectrum.readthedocs.io/en/latest/ref_param.html

# https://github.com/QuantEcon/quantecon-notebooks-python/blob/master/arma.ipynb
# https://github.com/QuantEcon/lecture-python-intro
# https://quantecon.org/quantecon-py/
# https://quantecon.org/

#+include: 00preambulo_lecciones.txt
#+LaTeX_HEADER: \DeclareMathOperator*{\plim}{plim}

#+begin_src emacs-lisp :results silent :exports none
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((latex . t)))
#+end_src


#+BEGIN_SRC emacs-lisp :exports none :results silent
(use-package ox-ipynb
  :load-path (lambda () (expand-file-name "ox-ipynb" scimax-dir)))
(use-package htmlize)
#+END_SRC

#+LATEX: \maketitle

#+begin_abstract
Repasaremos los instrumentos de identificación y diagnosis del análisis univariante.
Extenderemos la notación para incorporar modelos con raíces unitarias y modelos estacionales.
Finalmente resumiremos las ideas principales del análisis univariante.
#+end_abstract

- ([[https://mbujosab.github.io/Econometria-Aplicada/Transparencias/Lecc07.slides.html][slides]]) --- ([[https://mbujosab.github.io/Econometria-Aplicada/Lecciones-html/Lecc07.html][html]]) --- ([[https://mbujosab.github.io/Econometria-Aplicada/Lecciones-pdf/Lecc07.pdf][pdf]]) --- ([[https://mybinder.org/v2/gh/mbujosab/Econometria-Aplicada/gh-pages?labpath=CuadernosElectronicos/Lecc07.ipynb][mybinder]])


# #+begin_export html
# <style>
# .reveal  td {font-size: 60%;}
# </style>
# #+end_export


**** Contrastar la normalidad de los residuos con el test Jarque-Bera.
[[https://en.wikipedia.org/wiki/Jarque%E2%80%93Bera_test][Jarque-Bera test (Wikipedia)]]
- La transformación logarítmica :: suele inducir normalidad si no hay datos negativos.

#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python :exports code :results raw
from scipy import stats
rng = np.random.default_rng()
x = rng.normal(0, 1, 100000)
jarque_bera_test = stats.jarque_bera(x)
jarque_bera_test
# jarque_bera_test.statistic
# jarque_bera_test.pvalue
#+END_SRC

#+RESULTS:
: SignificanceResult(statistic=0.8177207377470701, pvalue=0.6644069977431221)

# - Si hay valores atípicos :: el mejor tratamiento es /intervenirlos/.


